package pet;
/* ====================================================================== */
/**
 * @brief ペットクラス
 *
 * @note 演習１４−２　ペットの名前と主人の名前のフィールドを持つ
 */
/* ====================================================================== */

public class Pet {
	
	/* ====フィールド==== */
	private String mPetName; // 名前
	private String mMasterName; // 主人の名前

	/* ====コンストラクタ==== */
	public Pet(String name ,String masterName) {
		//名前を決定
		mPetName = name;
		//主人の名前を決定
		mMasterName = masterName;
	}
	
	/* ====================================================================== */
	/**
	 * @brief ペットの名前を返却するメソッド
	 *
	 * @param 
	 *
	 * @return mPetName ペットの名前
	 *
	 * @note
	 * 
	 * 
	 */
	/* ====================================================================== */
	public String getName(){
		//ペットの名前を返却
		return mPetName;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 主人の名前を返却するメソッド
	 *
	 * @param 
	 *
	 * @return mMasterName 主人の名前
	 *
	 * @note
	 * 
	 * 
	 */
	/* ====================================================================== */
	public String getMasterName(){
		//主人の名前を返却
		return mMasterName;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 自己紹介するメソッド
	 *
	 * @param 
	 *
	 * @return 
	 *
	 * @note
	 * 
	 * 
	 */
	/* ====================================================================== */
	public void introduce(){
		//自己紹介（自分の名前）
		System.out.println("■僕の名前は️" + getName() + "です！");
		//自己紹介（主人の名前）
		System.out.println("■ご主人様は️" + getMasterName() + "です！");
	}
	
}
