package pet;

/* ====================================================================== */
/**
 * @brief ロボットペットクラス
 *
 * @note 演習１４−２ スーパークラスPetのサブクラス
 */
/* ====================================================================== */
public class RobotPet extends Pet{

	/* ====フィールド==== */
	// なし

	/* ====コンストラクタ==== */
	public RobotPet(String name, String masterName) {
		// スーパークラスのコンストラクタを呼び出す
		super(name, masterName);
	}

	/* ====================================================================== */
	/**
	 * @brief 自己紹介するメソッド
	 *
	 * @param
	 *
	 * @return
	 *
	 * @note スーパークラスのintroduceメソッドをオーバーライド
	 * 
	 * @Override
	 */
	/* ====================================================================== */
	public void introduce() {
		// 自己紹介（自分の名前）
		System.out.println("◇僕はロボットであり名前は️" + getName() + "。");
		// 自己紹介（主人の名前）
		System.out.println("◇ご主人様は️" + getMasterName() + "。");
	}

}