package player;

import static number.Constants.*;
import static number.Number.*;



/* ====================================================================== */
/**
 * @brief 人間が操作するジャンケンプレイヤーの実装クラス
 *
 * @note このクラスは抽象クラスPlayerから派生したクラス
 * 具体的な操作ジャンケンプレイヤーは、このクラスで実装する
 * 
 * @see Player
 */
/* ====================================================================== */
public class You extends Player {
	
	/* ====フィールド==== */
	
	//フィールドなし
	
	/* ====コンストラクタ==== */
	public You(){
		//なにもしない
	}
	
	/* ====================================================================== */
	/**
	 * @brief 出した手の情報を表す文字列を返却する実装メソッド
	 *
	 * @param
	 *
	 * @return 
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	@Override
	public String toString() {
		//直線に関する情報を文字列で返却
		return "あなたの出した手(" + sHANDS[getHand()] + ")";
	}
	
	/* ====================================================================== */
	/**
	 * @brief 出す手を決定する実装メソッド
	 *
	 * @param
	 *
	 * @return 
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	@Override
	public void setHand() {
		// 出すジャンケンの手を決定（０・・グー/ １・・チョキ / ２・・パー ）
		mHand = inputRangeCheck(sJK_MIN, sJK_MAX, sINPUT_MSG);

	}

}
