package java09;
/* ====================================================================== */
/**
 * @brief 
 * 日付クラス第３版
 *
 * @note
 * 演習９−２
 */
/* ====================================================================== */
public class Day {
	/* ====フィールド==== */
	private int year = 1; //年（初期値を１とする）
	private int month = 1; //月（初期値を１とする）
	private int date = 1; //日付（初期値を１とする）
	
	/* ====コンストラクタ==== */
	public Day(){
		//各フィールドの初期値から何も動かさない
	}
	
	public Day(int year){
		//年を更新
		this.year = year;
	}
	
	public Day(int year , int month){
		//多重定義されたコンストラクタから年を更新
		this(year);
		
		//月を更新
		this.month = month;
	}
	
	public Day(int year , int month , int date){
		//多重定義されたコンストラクタから年と月を更新
		this(year , month);
		
		//日付を更新
		this.date = date;
	}
	
	public Day(Day d){
		//多重定義されたコンストラクタから年と月と日付を更新
		this(d.year , d.month , d.date);
	}
	
	/* ====================================================================== */
	/**
	 * @brief 
	 * 年を取得するメソッド
	 *
	 * @param なし
	 *
	 * @return year 年を取得
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	public int getYear() {
		//年を取得
		return year;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 
	 * 月を取得するメソッド
	 *
	 * @param なし
	 *
	 * @return month 月を取得
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	public int getMonth() {
		//月を取得
		return month;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 
	 * 日付を取得するメソッド
	 *
	 * @param なし
	 *
	 * @return date 日を取得
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	public int getDate() {
		//日を取得
		return date;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 
	 * 日付を設定するメソッド
	 *
	 * @param year 年 , month 月 , date 日
	 *
	 * @return 
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	public void setDay(int year , int month , int date) {
		//年をSet
		this.year = year;
		
		//月をSet
		this.month = month;
		
		//日をSet
		this.date = date;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 
	 * 曜日を求めるメソッド
	 *
	 * @param
	 *
	 * @return 
	 * 曜日を表す0~6のint型整数
	 *
	 * @note
	 * 当メソッドは「ツェラーの公式」をそのまま流用したものであるため、
	 * 処理内容についてコメントは省略する（テキストの指示通り）
	 * 
	 * 0 ・・・ 日曜、1 ・・・ 月曜、2 ・・・ 火曜、3 ・・・ 水曜、
	 * 4 ・・・ 木曜、5 ・・・ 金曜、6 ・・・ 土曜、
	 * 
	 */
	/* ====================================================================== */
	public int dayOfWeek() {
		int y = year;
		int m = month;
		if(m == 1 || m == 2){
			y--;
			m += 12;
		}
		return (y + y / 4 - y / 100 + y / 400 + (13 * m + 8) / 5 + date) % 7;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 
	 * 日付が等しいかを確認するメソッド
	 *
	 * @param d 日付クラスのインスタンス
	 *
	 * @return 
	 * 等しければtrue
	 * 等しくなければfalse
	 *
	 * @note
	 * 参照先が等しくなくても値が等しければtrueを返却する
	 * 
	 */
	/* ====================================================================== */
	public boolean equalTo(Day d) {
		//年、月、日が全て等しい場合にtrueを返却、そうでなければfalseを返却
		return d.year == year && d.month == month && d.date == date;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 
	 * 日付（曜日付き）を、文字列表現にしたものを返却するメソッド
	 *
	 * @param 
	 *
	 * @return 
	 * 日付（曜日付き）を、文字列表現にしたもの
	 *
	 * @note
	 * ●●●●年●●月●●日(曜日)
	 * 
	 */
	/* ====================================================================== */
	public String toString() {
		//曜日の日本語表現を格納した変数
		final String[] WD_JA = {"日","月","火","水","木","金","土"};
		
		//日付（曜日付き）を、文字列表現にして返却
		return String.format("%04d年%02d月%02d日(%s)", year,month,date,WD_JA[dayOfWeek()]);
	}
}

