package shape;

/* ====================================================================== */
/**
 * @brief 図形の直線を表す抽象クラス
 *
 * @note このクラスは抽象クラスShapeから派生したクラス
 * 具体的な直線クラスは、ここから派生する
 * @see Shape
 * @see HorzLine VirtLine
 */
/* ====================================================================== */

public abstract class AbstLine extends Shape {
	

	/* ====フィールド========================================================== */
	/**
	 * 
	 */
	/* ====================================================================== */
	private int mLength; //直性の長さ
	
	
	/* ====コンストラクタ====================================================== */
	/**
	 * @param length 長さ
	 * 
	 * @note 直性の長さを受け取るコンストラクタ
	 */
	/* ====================================================================== */
	public AbstLine(int length){
		//setLengthメソッドで引数から長さを設定
		setLength(length);
	}
	
	/* ====================================================================== */
	/**
	 * @brief 直線の長さを返却するメソッド
	 *
	 * @param 
	 *
	 * @return 直線の長さ
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	public int getLength(){
		//直線の長さを返却
		return mLength;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 直線の長さをSetするメソッド
	 *
	 * @param length 長さ
	 *
	 * @return 
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	public void setLength(int length){
		//直線の長さを設定
		mLength = length;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 直線に関する図形情報を表す文字列を返却する
	 *
	 * @param
	 *
	 * @return 
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	public String toString(){
		//直線に関する情報を文字列で返却
		return "AbstLine(length:" + mLength + ")";
	}

}
