package shape;
/**
 * 演習１３−２
 * 図形クラス群に対して、直角二等辺三角形を表すクラス群を追加せよ。
 * 左上が直角、左下が直角、右上が直角、右下が直角
 * の物を追加すること。
 * また、二等辺三角形の抽象クラスを作成し、そこから個々のクラスへ派生して作ること
 * 
 */

/* ====================================================================== */
/**
 * @brief 直角二等辺三角形を表す抽象クラス
 *
 * @note このクラスは抽象クラスShapeから派生したクラス
 * 具体的に「どの方向が直角」となるかは、この抽象クラスから派生して実装する
 * @see Shape
 * @see UpperRightTri UpperLeftTri DownRightTri DownLeftTri
 */
/* ====================================================================== */
public abstract class AbstIsosRightTriangle extends Shape {
	
	/* ====フィールド==== */
	private int mSides; //辺の長さ

	public AbstIsosRightTriangle(int sides) {
		//setSidesメソッドで引数から辺の長さを設定
		setSides(sides);
	}
	
	/* ====================================================================== */
	/**
	 * @brief 辺の長さを返却するメソッド
	 *
	 * @param 
	 *
	 * @return 辺の長さ
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	public int getSides(){
		//辺の長さを返却
		return mSides;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 辺の長さをSetするメソッド
	 *
	 * @param sides 辺の長さ
	 *
	 * @return 
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	public void setSides(int sides){
		//辺の長さを設定
		mSides = sides;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 辺に関する図形情報を表す文字列を返却する
	 *
	 * @param
	 *
	 * @return 
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	@Override
	public String toString() {
		//辺に関する情報を文字列で返却
		return "AbstIsosRightTriangle(sides:" + getSides() + ")";
	}

}
