package shape;
/* ====================================================================== */
/**
 * @brief 図形の水平直線を表すクラス
 *
 * @note このクラスは抽象クラスAbstLineから派生したクラス
 * 具体的な水平直線は、このクラスで実装する
 * 
 * @see Shape
 * @see AbstLine
 */
/* ====================================================================== */

public class HorzLine extends AbstLine {
	
	/* ====フィールド========================================================== */
	/**
	 * なし
	 */
	/* ====================================================================== */
	
	/* ====コンストラクタ====================================================== */
	/**
	 * @param length 長さ
	 * 
	 * @note 直性の長さを受け取る、スーパークラスのコンストラクタを呼び出す
	 */
	/* ====================================================================== */
	public HorzLine(int length) {
		//スーパークラスのコンストラクタを呼び出して水平直線の長さを設定
		super(length);
	}
	
	/* ====================================================================== */
	/**
	 * @brief 水平直線の情報を表す文字列を返却する
	 *
	 * @param
	 *
	 * @return 
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	public String toString(){
		//直線に関する情報を文字列で返却
		return "HorzLine(length:" + getLength() + ")";
	}
	
	/* ====================================================================== */
	/**
	 * @brief 水平直線を描写する実装メソッド
	 *
	 * @param
	 *
	 * @return 
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	public void draw(){
		//インスタンスの直線の長さの分だけ’-’を出力する
		for (int i = 0 ; i < getLength() ; i++){
			//水平線を出力
			System.out.print('-');
		}
		//１行出力し終わったら改行
		System.out.println();
	}

}