package shape;
/* ====================================================================== */
/**
 * @brief 点を表すクラス
 *
 * @note 図形を表す抽象クラスShapeから派生したクラス
 * @see Shape
 */
/* ====================================================================== */
public class Point extends Shape {
	
	/* ====フィールド==== */
	
	//フィールドなし
	
	
	/* ====コンストラクタ==== */
	public Point(){
		//なにもしない
	}
	
	/* ====================================================================== */
	/**
	 * @brief 抽象クラスShapeの抽象メソッドtoStringを実装する
	 *
	 * @param 
	 *
	 * @return 常に"Point"の文字列を返却
	 *
	 * @note
	 * 点に関する図形情報を返却する
	 * 
	 */
	/* ====================================================================== */
	public String toString(){
		return "Point";
	}
	
	/* ====================================================================== */
	/**
	 * @brief 抽象クラスShapeの抽象メソッドdrawを実装する
	 *
	 * @param 
	 *
	 * @return 
	 *
	 * @note
	 * 点[*]を１つだけ描写して改行する
	 * 
	 */
	/* ====================================================================== */
	public void draw(){
		//点[*]を１つだけ描写して改行する
		System.out.println('*');
	}

}
