package shape;

/* ====================================================================== */
/**
 * @brief 図形の概念を表す抽象クラス
 *
 * @note 具体的な図形クラスはここから派生する
 * @see Object
 */
/* ====================================================================== */
public abstract class Shape {
	
	/* ====================================================================== */
	/**
	 * @brief 図形情報をあらわす文字列を返却する抽象メソッド
	 *
	 * @param 
	 *
	 * @return 
	 *
	 * @note
	 * クラスShapeから派生するクラスでこのメソッドの本体を実装する
	 * 
	 */
	/* ====================================================================== */
	public abstract String toString();
	
	/* ====================================================================== */
	/**
	 * @brief 図形を描写するための抽象メソッド
	 *
	 * @param 
	 *
	 * @return 
	 *
	 * @note
	 * クラスShapeから派生するクラスでこのメソッドの本体を実装する
	 * 
	 */
	/* ====================================================================== */
	public abstract void draw();
	
	/* ====================================================================== */
	/**
	 * @brief 図形情報の表示と図形の描写を行うメソッド
	 *
	 * @param 
	 *
	 * @return 
	 *
	 * @note
	 * 以下の順番で処理を実行する
	 * 
	 * 1.	toStringメソッドで図形情報の出力
	 * 2.	drawメソッドで図形の描写
	 * 
	 */
	/* ====================================================================== */
	public void print(){
		//toStringメソッドを呼び出して図形情報の出力
		System.out.println(toString());
		
		//drawメソッドを呼び出して図形の描写
		draw();
	}

}
