package shape;
/* ====================================================================== */
/**
 * @brief 左上が直角の二等辺三角形を表す実装クラス
 *
 * @note このクラスは抽象クラスAbstIsosRightTriangleから派生したクラス
 * 具体的な左上直角の二等辺三角形インスタンスは、このクラスで生成する
 * @see Shape
 * @see AbstIsosRightTriangle
 */
/* ====================================================================== */
public class UpperLeftTri extends AbstIsosRightTriangle {
	
	/* ====フィールド==== */
	//なし
	
	/* ====コンストラクタ====================================================== */
	/**
	 * @param sides 辺の長さ
	 * 
	 * @note 辺の長さを受け取るスーパークラスのコンストラクタを呼び出す
	 */
	/* ====================================================================== */
	public UpperLeftTri(int sides) {
		//スーパークラスのコンストラクタを呼び出して辺の長さを設定
		super(sides);
	}
	
	/* ====================================================================== */
	/**
	 * @brief 辺に関する図形情報を表す文字列を返却する
	 *
	 * @param
	 *
	 * @return 
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	@Override
	public String toString() {
		//辺に関する情報を文字列で返却
		return "UpperLeftTri(sides:" + getSides() + ")";
	}
	
	/* ====================================================================== */
	/**
	 * @brief 左上直角の二等辺三角形を描写する実装メソッド
	 *
	 * @param
	 *
	 * @return 
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	@Override
	public void draw() {
		int tmpSpace = 0; //空白スペース描写用の変数
		
		//辺の長さ分周回して左上直角の二等辺三角形を描写する
		for(int i = 0 ; i < getSides() ; i++){
			//＊を描写する
			for(int j = 0 ; j < getSides() - tmpSpace ; j++){
				System.out.print("＊");
			}
			//空白スペースを描写する
			for(int j = 0 ; j < tmpSpace ; j++){
				System.out.print("　");
			}

			//１行出力終わったら改行
			System.out.println();
			//空白スペースを1加算
			tmpSpace++;
		}

	}

}
