package model;

/* ====================================================================== */
/**
 * @brief 着せ替えインターフェース
 *
 * @note スキンを変更させるインターフェース
 * 
 */
/* ====================================================================== */
public interface Skinnable {
	/* ====フィールド==== */
	int sBLACK = 0; //黒
	int sRED = 1; //赤
	int sGREEN = 2; //緑
	int sBLUE = 3; //青
	int sLEOPARD = 4; //ヒョウ柄
	
	int sSKIN_MIN = sBLACK; //最小値
	int sSKIN_MAX = sLEOPARD; //最大値
	
	/* ====================================================================== */
	/**
	 * @brief 着せ替えする抽象メソッド
	 *
	 * @param
	 *
	 * @return 
	 *
	 * @note
	 * 
	 */
	/* ====================================================================== */
	void changeSkin();
 
}
