package dvdPlayer;

import model.ExPlayer;

/* ====================================================================== */
/**
 * @brief DVDプレイヤークラス
 *
 * @note 演習１４−３　DVDの再生、終了、スロー再生を行う
 */
/* ====================================================================== */
public class DVDPlayer implements ExPlayer {
	
	/* ====フィールド==== */
	//なし

	/* ====コンストラクタ==== */
	//なし
	
	/* ====================================================================== */
	/**
	 * @brief 再生をするインターフェースの実装メソッド
	 *
	 * @param 
	 *
	 * @return
	 *
	 * @note
	 * DVDの再生を行う
	 * 
	 */
	/* ====================================================================== */
	@Override
	public void play() {
		// DVD再生開始したことを表すメッセージを出力
		System.out.println("■DVD再生開始");
		
	}
	
	/* ====================================================================== */
	/**
	 * @brief 再生を停止するインターフェースの実装メソッド
	 *
	 * @param 
	 *
	 * @return
	 *
	 * @note
	 * DVDの再生を停止する
	 * 
	 */
	/* ====================================================================== */
	@Override
	public void stop() {
		// DVD再生が停止したことを表すメッセージを出力
		System.out.println("■DVD停止");
		
	}

	/* ====================================================================== */
	/**
	 * @brief スロー再生をするインターフェースの実装メソッド
	 *
	 * @param 
	 *
	 * @return
	 *
	 * @note
	 * DVDのスロー再生を行う
	 * 
	 */
	/* ====================================================================== */
	@Override
	public void slowPlay() {
		// DVDスロー再生したことを表すメッセージを出力
		System.out.println("■DVDスロー再生");
		
	}
	
}
