package java10;

/**
 * 
 * @author masahiro
 * 連番クラスIdを、以下のように変更したクラスExIdを作成せよ。
 * インスタンスを生成するたびに識別番号をnずつ増やして与える（nは正の整数）
 * nの数は、指定されない限り1とするが、メソッドを通じて変更可能
 */

/* ====================================================================== */
/**
 * @brief 
 * 連番クラス改
 *
 * @note
 * 
 */
/* ====================================================================== */

public class ExId {
	
	/* ====フィールド==== */
	private static int sCounter = 0; //いくつ識別番号を作成したか
	private static int sBeforeNum = 0; //何番までの識別番号を与えたか	
	private static int sAddedValue = 1; //識別番号加算値 (変更可能だが変更前は１)	
	private int mId; //識別番号
	
	/* ====コンストラクタ==== */
	public ExId(){
		//何番までの識別番号を与えたかをカウント
		++sCounter;
		//インスタンス生成ごとに特定の識別番号を加算する。
		mId = sBeforeNum + sAddedValue;
		sBeforeNum = mId;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 
	 * 識別番号を取得するメソッド
	 *
	 * @param なし
	 *
	 * @return 
	 * 
	 *
	 * @note
	 */
	/* ====================================================================== */
	public int getId(){
		//識別番号を返却
		return mId;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 
	 * 最後に与えた識別番号を取得するメソッド
	 *
	 * @param なし
	 *
	 * @return 
	 * 
	 *
	 * @note
	 * インスタンスをn個生成した時点で呼び出すとnを返すこと
	 */
	/* ====================================================================== */
	public static int getMaxId(){
		//最後に与えた識別番号を返却
		return sBeforeNum;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 
	 * 加算値を変更するメソッド
	 *
	 * @param changeValue　変更する値
	 *
	 * @return 
	 * 
	 * @note
	 * 
	 */
	/* ====================================================================== */
	public static void setAddedValue(int changeValue){
		//加算値を更新
		sAddedValue = changeValue;
	}
}