package java10;
/**
 * 
 * @author masahiro
 * P340の連番クラスに、最後に与えた識別番号を返すクラスメソッドを追加せよ。
 * インスタンスをn個生成した時点で呼び出すとnを返すこと
 *
 */

/* ====================================================================== */
/**
 * @brief 
 * 連番クラス
 *
 * @note
 * 
 */
/* ====================================================================== */

public class Id {
	
	/* ====フィールド==== */
	private static int sCounter = 0; //何番までの識別番号を与えたか
	private int mId; //識別番号

	/* ====コンストラクタ==== */
	public Id(){
		//インスタンス生成ごとにカウンタを加算する。
		mId = ++sCounter;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 
	 * 識別番号を取得するメソッド
	 *
	 * @param なし
	 *
	 * @return 
	 * 
	 *
	 * @note
	 */
	/* ====================================================================== */
	public int getId(){
		//識別番号を返却
		return mId;
	}
	
	/* ====================================================================== */
	/**
	 * @brief 
	 * 最後に与えた識別番号を取得するメソッド
	 *
	 * @param なし
	 *
	 * @return 
	 * 
	 *
	 * @note
	 * インスタンスをn個生成した時点で呼び出すとnを返すこと
	 */
	/* ====================================================================== */
	public static int getMaxId(){
		//最後に与えた識別番号を返却
		return sCounter;
	}
	
}
